## Assignment 2 - Working with Pandas

1. Create a DataFrame with the following data:  
  


  data = {
      'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
      'Age': [24, 27, 22, 32, 29],
      'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
      'Salary': [45000, 54000, 50000, 62000, 47000]
  }
  
  a. Print the first five rows of the DataFrame.  
  b. Get the summary statistics of the 'Age' and 'Salary' columns.  
  c. Calculate the average salary of employees in the 'HR' department.

In [76]:
import numpy as np
import pandas as pd

In [78]:
data = { 'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'], 'Age': [24, 27, 22, 32, 29],
        'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'], 'Salary': [45000, 54000, 50000, 62000, 47000] }
data

{'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
 'Age': [24, 27, 22, 32, 29],
 'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
 'Salary': [45000, 54000, 50000, 62000, 47000]}

In [119]:
df=pd.DataFrame(data)

In [121]:
df

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

In [123]:
df.head()

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

In [125]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   26.800000  51600.000000
std     3.962323   6730.527468
min    22.000000  45000.000000
25%    24.000000  47000.000000
50%    27.000000  50000.000000
75%    29.000000  54000.000000
max    32.000000  62000.000000

In [134]:
a=df[df['Department'] == 'HR']

In [136]:
b=a['Salary']

In [138]:
print("Average: ",np.mean(b))

Average:  46000.0

## Description

I have created the given data using dictionary and dataframe is created by df=pd.DataFrame(data) here df is the variable.To print the first 5 rows i have used df.head() as it can print first 5 rows as default.To get the summary statistics of the 'Age' and 'Salary' columns i established df.describe() for the statistical information.To get the average salary of hr department i implemented a=df[df['Department'] == 'HR'] to check whether deparment is equal to hr.then b=a['Salary'] if the department is equal to hr then store the salary in b.then i used np.mean(b) to print the average of b.

2. Add a new column, 'Bonus', which is 10% of the salary.

In [141]:
df['Bonus']=df['Salary']*0.10
df

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

## Description

To add a new column called bonus I have used df['Bonus']=df['Salary']*0.10.here df[Bonus]is the new column.df[Salary]*010 is the 10 percetage of salary for each members in the data so,the 10 % salary is stored in the new column named bonus.

3. Filter the DataFrame to show employees aged between 25 and 30.

In [98]:
a=df[(df['Age']>=25) & (df['Age']<=30)]
a

  Name  Age Department  Salary   Bonus
1  Bob   27    Finance   54000  5400.0
4  Eve   29         HR   47000  4700.0

## Description

To filter the DataFrame to show employees aged between 25 and 30 i used the condition a=df[(df['Age']>=25) & (df['Age']<=30)] which includes the members aged between 25 and 30.

4. Group the data by 'Department' and calculate the average salary for each department.

In [101]:
df=df.groupby('Department')['Salary'].mean()

In [103]:
df

Department
Finance      54000.0
HR           46000.0
IT           50000.0
Marketing    62000.0
Name: Salary, dtype: float64

### Description

 To group the data by 'Department' and calculate the average salary for each department. i used groupby function df=df.groupby('Department')['Salary'].mean().here the data is grouped by department [salary].mean is used to find the average or mean of each department.

5. Sort the DataFrame by 'Salary' in ascending order and save the result to a new CSV file.

In [146]:
df_sorted = df.sort_values(by='Salary', ascending=True)

In [148]:
df_sorted

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
4      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
1      Bob   27    Finance   54000  5400.0
3    Diana   32  Marketing   62000  6200.0

In [150]:
df_sorted.to_csv('pandas_.csv', index=False)

In [161]:
df2=pd.read_csv('pandas_.csv')

In [163]:
df2

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
3      Bob   27    Finance   54000  5400.0
4    Diana   32  Marketing   62000  6200.0

## Description

To Sort the DataFrame by 'Salary' in ascending order I implemented df_sorted = df.sort_values(by='Salary', ascending=True) which mean it is sorted by salary in ascending order . To save the result to a new CSV file i have used variable.to_csv('filename',index=False) that is df_sorted.to_csv('pandas_.csv', index=False) here index = False mean that the index started from 0 in order i assigned it because when we sort the data in ascending order the index was rearranged so, to arrange it properly i assigned it as False. Finally i called the new csv file.